In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.fillna(method = 'bfill')

0    artichoke
1    artichoke
2      avocado
3      avocado
dtype: object

In [9]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [10]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))

In [24]:
df.iloc[:4, 1] = NA

In [25]:
df.iloc[:2, 2] = NA

In [26]:
df

          0         1         2
0 -1.004877       NaN       NaN
1 -0.369268       NaN       NaN
2  1.427350       NaN -2.099097
3 -2.257920       NaN  0.663663
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [27]:
df.dropna()

          0         1         2
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [28]:
df.dropna(thresh=2)

          0         1         2
2  1.427350       NaN -2.099097
3 -2.257920       NaN  0.663663
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [29]:
df.fillna(0)

          0         1         2
0 -1.004877  0.000000  0.000000
1 -0.369268  0.000000  0.000000
2  1.427350  0.000000 -2.099097
3 -2.257920  0.000000  0.663663
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.004877  0.500000  0.000000
1 -0.369268  0.500000  0.000000
2  1.427350  0.500000 -2.099097
3 -2.257920  0.500000  0.663663
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [31]:
_ = df.fillna(0, inplace=True)

In [32]:
df

          0         1         2
0 -1.004877  0.000000  0.000000
1 -0.369268  0.000000  0.000000
2  1.427350  0.000000 -2.099097
3 -2.257920  0.000000  0.663663
4  0.926904 -0.900851  0.476308
5  2.068080 -0.156248 -0.482555
6  0.897881  2.237042 -1.560212

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA

In [35]:
df.iloc[4:, 2] = NA

In [36]:
df

          0         1         2
0 -0.527177  0.678824 -0.198554
1 -0.934388 -1.054608  0.961035
2  1.138307       NaN -0.810058
3  1.673941       NaN -1.520563
4 -0.999275       NaN       NaN
5 -0.294124       NaN       NaN

In [37]:
df.fillna(method='ffill')

          0         1         2
0 -0.527177  0.678824 -0.198554
1 -0.934388 -1.054608  0.961035
2  1.138307 -1.054608 -0.810058
3  1.673941 -1.054608 -1.520563
4 -0.999275 -1.054608 -1.520563
5 -0.294124 -1.054608 -1.520563

In [38]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.527177  0.678824 -0.198554
1 -0.934388 -1.054608  0.961035
2  1.138307 -1.054608 -0.810058
3  1.673941 -1.054608 -1.520563
4 -0.999275       NaN -1.520563
5 -0.294124       NaN -1.520563

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
meat_to_animal = {'bacon': 'pig','pulled pork': 'pig','pastrami': 'cow','corned beef': 'cow','honey ham': 'pig','nova lox': 'salmon'}

In [51]:
lowercased = data['food'].str.lower()

In [52]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [53]:
data['animal'] = lowercased.map(meat_to_animal)

In [54]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [55]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [56]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [57]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [60]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [63]:
transform = lambda x: x[:4].upper()

In [64]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [65]:
data.index = data.index.map(transform)

In [66]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [68]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [69]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [70]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [72]:
bins = [18, 25, 35, 60, 100]

In [73]:
cats = pd.cut(ages, bins)

In [74]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [75]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [76]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [77]:
 pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [78]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [79]:
 group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [80]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [81]:
data = np.random.rand(20)

In [82]:
pd.cut(data, 4, precision=2)

[(0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.25, 0.49], (0.25, 0.49], ..., (0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.49, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.013, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [83]:
data = np.random.randn(1000)

In [84]:
cats = pd.qcut(data, 4)

In [85]:
cats

[(-0.681, -0.072], (-0.072, 0.598], (-0.681, -0.072], (0.598, 3.423], (0.598, 3.423], ..., (-3.335, -0.681], (0.598, 3.423], (0.598, 3.423], (0.598, 3.423], (0.598, 3.423]]
Length: 1000
Categories (4, interval[float64]): [(-3.335, -0.681] < (-0.681, -0.072] < (-0.072, 0.598] < (0.598, 3.423]]

In [86]:
pd.value_counts(cats)

(-3.335, -0.681]    250
(-0.681, -0.072]    250
(-0.072, 0.598]     250
(0.598, 3.423]      250
dtype: int64

In [87]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.349, -0.072], (-0.072, 1.138], (-1.349, -0.072], (-0.072, 1.138], (1.138, 3.423], ..., (-1.349, -0.072], (-0.072, 1.138], (-0.072, 1.138], (-0.072, 1.138], (-0.072, 1.138]]
Length: 1000
Categories (4, interval[float64]): [(-3.335, -1.349] < (-1.349, -0.072] < (-0.072, 1.138] < (1.138, 3.423]]

In [88]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034919     0.032807     0.013449     0.027586
std       0.989374     0.989375     1.005735     1.005771
min      -2.666487    -2.996646    -3.833474    -3.276848
25%      -0.659960    -0.657310    -0.662415    -0.639844
50%       0.008504     0.059440     0.043713     0.029020
75%       0.742147     0.697803     0.661129     0.665285
max       3.264173     3.291341     4.310295     2.919129

In [90]:
col = data[2]

In [91]:
col[np.abs(col) > 3]

3     -3.042866
333   -3.062930
395   -3.833474
431   -3.588708
507    3.044293
601    4.310295
Name: 2, dtype: float64

In [92]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
3   -1.147194  0.096292 -3.042866  0.205227
166 -0.682765 -1.051656 -0.412994 -3.276848
242  3.264173  1.065506  0.597522 -1.042250
328  0.816962 -0.501660  0.005145 -3.094906
333 -0.269004 -1.068739 -3.062930  0.819778
393 -0.730730  0.626718  1.136512 -3.262360
395 -0.046363 -0.129837 -3.833474 -0.378318
424 -0.117655  3.057086 -0.944659  0.268178
431  1.037979  1.006359 -3.588708  1.623916
507 -1.065075  0.920444  3.044293  0.541803
549  1.395076 -1.067770 -0.440496 -3.203129
601 -0.715470 -0.283631  4.310295 -1.123030
718  3.061568 -0.888874 -0.617407 -2.175913
778 -0.351228  3.198420 -0.799687  2.606633
953  0.279991  3.291341 -0.226484  1.271245

In [93]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [94]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034593     0.032261     0.013623     0.028423
std       0.988359     0.987667     0.995700     1.003147
min      -2.666487    -2.996646    -3.000000    -3.000000
25%      -0.659960    -0.657310    -0.662415    -0.639844
50%       0.008504     0.059440     0.043713     0.029020
75%       0.742147     0.697803     0.661129     0.665285
max       3.000000     3.000000     3.000000     2.919129

In [95]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1 -1.0  1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

In [96]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [97]:
sampler = np.random.permutation(5)

In [98]:
sampler

array([1, 4, 2, 0, 3])

In [99]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [100]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [101]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [102]:
choices = pd.Series([5, 7, -1, 6, 4])

In [103]:
draws = choices.sample(n=10, replace=True)

In [104]:
draws

2   -1
4    4
0    5
4    4
3    6
3    6
0    5
0    5
4    4
4    4
dtype: int64

In [105]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [106]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [107]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [108]:
df_with_dummy = df[['data1']].join(dummies)

In [109]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
mnames = ['movie_id', 'title', 'genres']

In [111]:
movies = pd.read_table('movies.dat', sep='::',
                       header=None, names=mnames)

<ipython-input-111-40bfb6f155d4>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('movies.dat', sep='::',

In [112]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [113]:
all_genres = []

In [114]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [115]:
genres = pd.unique(all_genres)

In [116]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [117]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [118]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [119]:
gen = movies.genres[0]

In [120]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [121]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [122]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [123]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [124]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [125]:
np.random.seed(12345)

In [126]:
values = np.random.rand(10)

In [127]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [128]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [129]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [130]:
val = 'a,b, guido'

In [131]:
val.split(',')

['a', 'b', ' guido']

In [132]:
pieces = [x.strip() for x in val.split(',')]

In [133]:
pieces

['a', 'b', 'guido']

In [134]:
first, second, third = pieces

In [135]:
first + '::' + second + '::' + third

'a::b::guido'

In [136]:
'::'.join(pieces)

'a::b::guido'

In [137]:
'guido' in val

True

In [138]:
val.index(',')

1

In [200]:
val.find(':')

-1

In [140]:
val.index(':')

ValueError: substring not found

In [142]:
val.count(',')

2

In [143]:
val.replace(',', '::')

'a::b:: guido'

In [144]:
val.replace(',', '')

'ab guido'

In [145]:
val.count('b')

1

In [146]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [147]:
val.count('can')

2

In [148]:
val.endswith('operations')

True

In [149]:
val.startswith('Regular')

True

In [150]:
vall = 'Python built-in string methods'

In [151]:
'.'.join(vall)

'P.y.t.h.o.n. .b.u.i.l.t.-.i.n. .s.t.r.i.n.g. .m.e.t.h.o.d.s'

In [152]:
vall.index('o')

4

In [155]:
vall.find('z')

-1

In [156]:
vall.rfind('o')

27

In [157]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [158]:
val.replace('many','few')

'Regular expressions can also be used with few of these operations,Regular expressions can also be used with few of these operations'

In [159]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [160]:
val.replace('many','few',1)

'Regular expressions can also be used with few of these operations,Regular expressions can also be used with many of these operations'

In [161]:
vall = '   Python built-in   string methods   '

In [162]:
vall

'   Python built-in   string methods   '

In [163]:
vall.strip()

'Python built-in   string methods'

In [164]:
vall.rstrip()

'   Python built-in   string methods'

In [165]:
vall.lstrip()

'Python built-in   string methods   '

In [166]:
vall = "Python built-in string methods"

In [167]:
vall.split('-')

['Python built', 'in string methods']

In [168]:
vall.lower()

'python built-in string methods'

In [169]:
vall.upper()

'PYTHON BUILT-IN STRING METHODS'

In [171]:
vall.casefold()

'python built-in string methods'

In [198]:
vall.rjust(40,'_')

'__________Python built-in string methods'

In [199]:
vall.ljust(40,'*')

'Python built-in string methods**********'

In [194]:
movies["genres"].str.ljust(15,'_')

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                    Comedy|Romance_
3                    Comedy|Drama___
4                    Comedy_________
                    ...
3878                 Comedy_________
3879                 Drama__________
3880                 Drama__________
3881                 Drama__________
3882                 Drama|Thriller_
Name: genres, Length: 3883, dtype: object

In [195]:
movies["genres"].str.rjust(15,'*')

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                    *Comedy|Romance
3                    ***Comedy|Drama
4                    *********Comedy
                    ...
3878                 *********Comedy
3879                 **********Drama
3880                 **********Drama
3881                 **********Drama
3882                 *Drama|Thriller
Name: genres, Length: 3883, dtype: object